#+TITLE: Research
#+OPTIONS: toc:nil title:nil

* Ongoing Projects
- Egress modeling of metro stations
- Assessment of perimeter fire and smoke barriers through full-scale fire experiment

* Completed Projects
- Computational modeling of energetic materials subjected to thermal and mechanical insults using the material point method
- Assessment of perimeter fire and smoke barriers through full-scale fire experiment
- Cultural Heritage Preservation and Restoration using Digital 3D Models
- Containers for housing and re-urbanization of slums, refugee camps and other human settlements in post-disaster context, with EPFL Lausanne and UTM Malaysia.
- Experimental investigation of fire behavior of different type of facade used in buildings, Underwriters Laboratories
- Development of smart, environment friendly and low-cost fire detection and suppression systems, Uchchatar Avishkar Yojana
- To assess effectiveness of FR ACP sheets compared to non-FR ACP sheets
	
* Publications
** Books
#+BEGIN_SRC emacs-lisp :results raw :exports results :eval yes
  (setq cv-buffer (find-file-noselect "~/Nextcloud/Notes/elisp/cv.org"))
  (with-current-buffer cv-buffer
    (goto-char (point-min))
    (search-forward-regexp "^\* Books$")
    (org-narrow-to-subtree)
    (goto-char (point-min))
    (kill-whole-line)
    (setq my-text (buffer-string))
    (evil-undo 1)
    (widen)
  );cv-buffer
  (org-babel-remove-result)
  (print my-text)
#+END_SRC

#+RESULTS:
1. S. Chandrasekaran and G. Srivastava. 2023. /Fire-resistant Design of Structures/. Boca Raton: CRC Press. 9781003328711.
1. G. Srivastava and P. Gandhi. 2023. /Performance of Combustible Facade Systems used in Green Building Technologies under Fire/. Singapore: Springer. 9789811631122.
1. S. Chandrasekaran and G. Srivastava. 2018. /Design Aids of Offshore Structures Under Special Environmental Loads Including Fire Resistance/. Springer. 9789811076077.
1. D. Nakrani and G. Srivastava. 2021. /Quantification of enhanced fire severity in modern buildings/. Eds.: A.K. Gupta, A. De, S.K. Aggarwal, and A. Kushari. In: Advances in Energy and Combusion: Safety and Sustainability. Springer Nature. Pages 413-427. 9789811626470.

** Refereed Journal Publications
#+BEGIN_SRC emacs-lisp :results drawer :exports results :eval yes
  (setq cv-buffer (find-file-noselect (concat gs-gscloud-d "/notes/elisp/cv.org")))

  (with-current-buffer cv-buffer
    (goto-char (point-min))
      (search-forward-regexp "^\* Refereed Journal Publications$")
      (org-narrow-to-subtree)
      (forward-line)
      (setq my-text (buffer-substring-no-properties (point) (point-max)))
      ;(buffer-substring-no-properties (point) (point-max))
      (widen)
  );cv-buffer

  (print my-text)
#+END_SRC

#+RESULTS:
:results:
1. Vikash Singh and G. Srivastava. 2024. "Development of sustainable geopolymer using blast furnace slag and lithium hydroxide". /Sustainable Materials and Technologies/ 40, pages: e00934. DOI: [[https://www.doi.org/10.1016/j.susmat.2024.e00934]].
1. G. Srivastava and V.K. Singh. 2024. "Effect of Methyl Cellulose on cement hydration and pore creation in high strength mixes at elevated temperatures". /ASCE Journal of Materials in Civil Engineering/. submitted.
1. V.K. Singh and K. Jasuja and G. Srivastava. 2023. "Enhancing stabilization and early age hydration of dicalcium silicate using TiB_2 derived nanosheets". /ACS Applied Engineering Materials/. DOI: [[https://www.doi.org/10.1021/acsaenm.3c00025]].
1. D. Yadav, R. Ayyagari, and G. Srivastava. 2023. "Effect of Cavity Radiation in Aluminium Hollow Tubes and Curtain Wall System Subjected to Fire". /Journal of Structural Fire Engineering/. accepted.
1. G. Srivastava and V.K. Singh. 2023. "Effect of PVME on cement hydration and pore creation in mortar at elevated temperatures". /ASCE Journal of Materials in Civil Engineering/ 35(4), pages: 04023028. DOI: [[https://www.doi.org/10.1061/(ASCE)MT.1943-5533.0004684]].
1. D. Nakrani and G. Srivastava. 2022. "Experimental study on fire performance of ventilated facade system". /Quarterly Journal of Indian Association of Structural Engineers/ 12(4), pages: 70--81.
1. D. Nakrani, M. Tiwari, T. Wani, and G. Srivastava. 2023. "Characterization of combustion of hardwood and softwood through experimental and computer simulations". /Journal of Thermal Analysis and Calorimetry/. DOI: [[https://www.doi.org/10.1007/s10973-023-12261-7]].
1. G. Srivastava and D. Nakrani and C. Ghoroi. 2020. "Performance of combustible façade systems with glass, ACP and firestops in full-scale, real-fire experiments". /Fire Technology/ 56(4), pages: 1575--1598 (Editor's Choice). DOI: [[https://www.doi.org/10.1007/s10694-019-00943-4]].
1. N.A. Khan and G. Srivastava. 2020. "Models for strength and stiffness of steel plate shear walls with openings". /Structures/ 27, pages: 2096--2113. DOI: [[https://www.doi.org/10.1016/j.istruc.2020.07.037]].
1. D. Nakrani and G. Srivastava. 2022. "Full-scale performance of combustible and non-combustible curtain wall systems with firestops". /Fire Technology/ 59(1), pages: 153--190. DOI: [[https://www.doi.org/10.1007/s10694-022-01342-y]].
1. C. Williams, K. Matous, G. Srivastava. 2023. "Continuum Modeling Predictions of Nonlinear Specific Heat in Phase Transition of Energetic Materials". /Journal of the Mechanics and Physics of Solids/, pages: 105401. accepted. DOI: [[https://www.doi.org/10.1016/j.jmps.2023.105401]].
1. P. Ravi Prakash and G. Srivastava. 2019. "Distributed plasticity model for analysis of steel structures subjected to fire using the direct stiffness method". /Fire Safety Journal/ 105, pages: 105--169. DOI: [[https://www.doi.org/10.1016/j.firesaf.2019.03.002]].
1. A. Roy, R. S. Chawhan, R. Patel, S. Varadharajan, L. M. Tiwari, A. L. Chakraborty, C. Ghoroi, and G. Srivastava. 2019. "Quantifying the CO and CO_2 mole fraction in the plume of an aerosol-based fire extinguishing agent using 4560 nm and 4320 nm QCLs". /IEEE Sensors Journal/. DOI: [[https://www.doi.org/10.1109/JSEN.2019.2927081]].
1. P. Ravi Prakash and G. Srivastava. 2018. "Fully coupled multi-physics nonlinear analysis of structural space frames subjected to fire using the direct stiffness method". /Advances in Structural Engineering/ 22(6), pages: 1266--1283. DOI: [[https://www.doi.org/10.1177/1369433218810641]].
1. G. Srivastava and P. Ravi Prakash. 2017. "An integrated framework for nonlinear analysis of plane frames exposed to fire using the direct stiffness method". /Computers and Structures/ 190, pages: 173--195. DOI: [[https://www.doi.org/10.1016/j.compstruc.2017.05.013]].
1. P. Ravi Prakash and G. Srivastava. 2017. "Nonlinear analysis of reinforced concrete plane frames exposed to fire using direct stiffness method". /Advances in Structural Engineering/ 21(7), pages: 1036--1050. DOI: [[https://www.doi.org/10.1177/1369433217737118]].
1. P. Kumar and G. Srivastava. 2018. "Effect of fire on in-plane and out-of-plane behavior of reinforced concrete frames with and without masonry infills". /Construction and Building Materials/ 167, pages: 82--95. DOI: [[https://www.doi.org/10.1016/j.conbuildmat.2018.01.116]].
1. N.A. Khan and G. Srivastava. 2018. "Enhanced Fire Severity in Modern Indian Dwellings - A case study from Ahmedabad, Gujarat". /Current Science/ 115(2), pages: 320--325. DOI: [[https://www.doi.org/www.jstor.org/stable/26978198]].
1. G. Srivastava and C. Ghoroi and P. Gandhi and V. Jagdish and G. Karthidefendedan and A. Chakravarthy and D. Nakrani. 2018. "Development of a unique full-scale real-fire facade testing facility at IIT Gandhiangar". /Current Science/ 115(9), pages: 1782--1787. DOI: [[https://www.doi.org/https://www.jstor.org/stable/26978494]].
1. A. Mandhyan and Gaurav Srivastava and S. Krishnamoorthi. 2016. "A Novel method for prediction of truss geometry from topology optimization". /Engineering with Computers/ 33, pages: 95--106. DOI: [[https://www.doi.org/10.1007/s00366-016-0474-x]].
1. P. Gandhi and V. Jagdish and G. Karthidefendedan and A. Chakravarthy and D. Nakrani and C. Ghoroi and G. Srivastava. 2017. "Performance of glass-ACP facade system in a full-scale real fire test in a G+2 structure". /Procedia Engineering/ 210, pages: 512--519. DOI: [[https://www.doi.org/10.1016/j.proeng.2017.11.108]].
1. P. Ravi Prakash and G. Srivastava. 2017. "Efficient three dimensional nonlinear thermo-mechanical analysis of structures subjected to fire". /Procedia Engineering/ 210, pages: 504--511. DOI: [[https://www.doi.org/10.1016/j.proeng.2017.11.107]].
1. P. Kumar and Gaurav Srivastava. 2017. "Numerical modeling of structural frames with infills subjected to thermal exposure: State-of-the-art review". /Journal of Structural Fire Engineering/. DOI: [[https://www.doi.org/10.1108/JSFE-05-2017-0031]].
1. Gaurav and S.F. Wojtkiewicz and E.A. Johnson. 2013. "Rapid Reanalysis of Generalized Eigenvalue Problem of Locally Perturbed Dynamical Systems". /Journal of Sound and Vibration/ 332, pages: 4354--4368. DOI: [[https://www.doi.org/10.1016/j.jsv.2013.03.016]].
1. S. Krishnamoorthi and Gaurav and A. Mandhyan. 2015. "Web Application for size and topology optimization of trusses and gusset plates". /{arXiv}/, pages: arXiv:1512.02881 [cs.OH]. DOI: [[https://www.doi.org/10.48550/arXiv.1512.02881]].
1. Gaurav and S.F. Wojtkiewicz and E.A. Johnson. 2011. "Efficient Uncertainty Quantification of Dynamical Systems with Local Nonlinearities and Uncertainties". /Probabilistic Engineering Mechanics/ 26, pages: 561--569. DOI: [[https://www.doi.org/10.1016/j.probengmech.2011.07.002]].
1. Gaurav and S.F. Wojtkiewicz. 2011. "Use of GPU Computing for Uncertainty Quantification in Computational Mechanics: A Case Study". /Scientific Programming/ 19, pages: 199--212. DOI: [[https://www.doi.org/10.3233/SPR-2011-0328]].
1. S.F. Wojtkiewicz and L. Khazanovich and Gaurav and R. Velasquez. 2010. "Probabilistic Numerical Simulation of Pavement Performance using MEPDG". /Road Materials and Pavement Design/ 11(2), pages: 291--306. DOI: [[https://www.doi.org/10.1080/14680629.2010.9690277]].
1. Wojtkiewicz, S.F. and Gaurav and Odes, Q.I.. 2011. "Efficient Frequency Response of Locally Uncertain Linear Structural Systems". /ASCE Journal of Engineering Mechanics/ 137(2), pages: 147--150. DOI: [[https://www.doi.org/10.1061/(ASCE)EM.1943-7889.0000212]].
1. S.K. Shukla, Gaurav and N. Sivakugan. 2009. "A Simplified Extension of the Conventional Theory of Arching in Soils". /International Journal of Geotechnical Engineering/ 3, pages: 353--359. DOI: [[https://www.doi.org/10.3328/IJGE.2009.03.03.353-359]].
1. Wojtkiewicz, S.F. and Gaurav. 2009. "Efficient Modal Analysis of Structures with Local Stiffness Uncertainties". /International Journal for Numerical Methods in Engineering/ 80, pages: 1007--1024. DOI: [[https://www.doi.org/10.1002/nme.2657]].
1. S. Chandrasekaran and Gaurav and A.K. Jain. 2010. "Ringing Response of Offshore Compliant Structures". /International Journal of Ocean & Climate Systems/ 1(3--4), pages: 133--144. DOI: [[https://www.doi.org/10.1260/1759-3131.1.3-4.133]].
1. Gaurav and Wojtkiewicz, S.F.. 2010. "Efficient Spectral Response of Locally Uncertain Linear Systems". /Probabilistic Engineering Mechanics/ 25(4), pages: 419--424. DOI: [[https://www.doi.org/10.1016/j.probengmech.2010.05.003]].
1. Gaurav and S.F. Wojtkiewicz and L. Khazanovich. 2011. "Optimal Design of Flexible Pavements using a Framework of DAKOTA and MEPDG". /International Journal of Pavement Engineering/ 12(2), pages: 137--148. DOI: [[https://www.doi.org/10.1080/10298436.2010.535535]].
1. S. Chandrasekaran and Gaurav. 2008. "Offshore Triangular TLP Earthquake Motion Analysis under Distinctly High Sea Waves". /Ship and Offshore Structures (Taylor & Francis)/ 3(3), pages: 173--184. DOI: [[https://www.doi.org/10.1080/17445300802051681]].
1. S. Chandrasekaran and Gaurav and S. Srivastava. 2008. "Structural response of Offshore TLPs under Seismic Excitations". /International Engineering & Technology Journal of Civil & Structures/ 1(1), pages: 7--12.
:end:

** Conference Publications and Presentations
#+BEGIN_SRC emacs-lisp :results drawer :exports results :eval yes
  (setq cv-buffer (find-file-noselect (concat gs-gscloud-d "/notes/elisp/cv.org")))

  (with-current-buffer cv-buffer
    (goto-char (point-min))
      (search-forward-regexp "^\* Conference Publications and Presentations$")
      (org-narrow-to-subtree)
      (forward-line)
      (setq my-text (buffer-substring-no-properties (point) (point-max)))
      ;(buffer-substring-no-properties (point) (point-max))
      (widen)
  );cv-buffer

  (print my-text)
#+END_SRC

#+RESULTS:
:results:
1. Gaurav. 2007. "Response of a Liquid-Tank Mounted Building Founded on Firm Ground to Random Vibration". /Proceedings of National Conference on Civil Engineering \& Technology/, Varanasi, India.
1. G. Srivastava. 2007. "Response of a Liquid-Tank Mounted Building Founded on Firm Ground to Random Vibration". /National Conference on Civil Engineering \& Technology/, Varanasi, India.
1. G. Srivastava and R. Kumar. 2005. "Linear Deflection Analysis of Beams using Genetic Algorithms". /All India Seminar on Innovations in Design and Construction of Concrete Structures/, Varanasi, India.
1. Gaurav. 2004. "Finite Difference Method Tool for Analysis of Combined Footings". /Proceedings of All India Seminar on Innovations in Design and Construction of Concrete Structures/, Varanasi, India.
1. G. Srivastava and S. Wojtkiewicz. 2009. "Efficient Response Estimation of Related Dynamical Systems Subjected to Random Inputs". /Tenth US National Congress on Computational Mechanics (USNCCM)/, Columbus, OH, USA.
1. Gaurav. 2004. "Role of Geo-synthetics in Civil Engineering". /Seminar on Recent Trends in Civil Engineering/, Varanasi, India.
1. G. Srivastava. 2004. "Finite Difference Method Tool for Analysis of Combined Footings". /All India Seminar on Innovations in Design and Construction of Concrete Structures/, Varanasi, India.
1. B. Gaudet, P. Gandhi and G. Srivastva. 2023. "Analysis of spill plume heat flux exposure on exterior surfaces from fire tests". /14th International Symposium on Fire Safety Science (IAFSS)/, Tsukaba, Japan.
1. N.A. Khan and Gaurav Srivastava. 2019. "Development of surrogate models for steel plate shear wall systems for parametric analysis". /Engineering Mechanics Institute Conference/, USA.
1. D. Yadav and G. Srivastva. 2022. "Characterization of blast loads due to explosion of energetic materials through multi-physics computer simulations". /4th Structural Integrity Conference and Exhibition/, Hyderabad, India.
1. Gaurav and R. Kumar and S. Mandal and V. Kumar. 2005. "Linear Deflection Analysis of Beams using Genetic Algorithms". /Proceedings of All India Seminar on Innovations in Design and Construction of Concrete Structures/, Varanasi, India, pages: 54--64.
1. D. Yadav and G. Srivastva. 2023. "Effect of standoff distance on response of steel sections subjected to near-field detonations". /International Fire Safety Symposium (IFireSS)/, Rio de Janerio, Brazil.
1. Nasar A. Khan and Gaurav Srivastava. 2017. "Need to revisit fire loads - findings from a recent survey at Ahmedabad". /International Conference on Safety (ICS) 2017/, India.
1. P. Kumar and Gaurav Srivastava. 2016. "Thermo-Mechanical Modeling of Reinforced Concrete Masonry Infill Panels Exposed to Fire". /EMI/PMC 2016/, USA.
1. P. Kumar and Gaurav Srivastava. 2014. "{FE} Analysis of RCC Masonry Infill Panels Subjected to Thermal Exposure". /International Conference on Safety (ICS) 2014/, India.
1. A. Mandhyan and Gaurav Srivastava and S. Krishnamoorthi. 2014. "Development of Web Application for Shape and Topology Optimization of Truss Structure and Gusset Plates". /{XXIV} International Workshop on Computational Micromechanics of Materials ({IWCMM})/, Spain.
1. Vaibhav Palkar and Gaurav Srivastava and Olga Kuksenok and Anna C. Balazs and Pratyush Dayal. 2015. "Using Stability Analyses to Predict Dynamic Behaviour of Self-oscillating Polymer Gels". /March Meeting of the American Physical Society (APS)/, USA.
1. P. R. Prakash and Gaurav Srivastava. 2017. "Progressive collapse analysis of {RCC} planar frames subjected to fire". /International Conference on Safety (ICS) 2017/, India.
1. P. R. Prakash and Gaurav Srivastava. 2014. "Development of Matrix Method for the Analysis of {RCC} Frames subjected to Fire". /International Conference on Safety (ICS) 2014/, India.
1. Gaurav Srivastava and Harsh L. Shah. 2014. "Modeling of Moisture in Masonry Structures: A Case-Study of Structures in {C}handkheda, {A}hmedabad". /International Conference on Advances in Civil, Structural and Mechanical Engineering (CSME)/, Hong Kong.
1. G. Srivastava and S. Wojtkiewicz. 2012. "Fast Calculation of Damped Eigenproperties of Locally Modified Linear Dynamical Systems". /ASCE EMI/PMC Conference 2012/, Notre Dame, IN, USA.
1. Gaurav Srivastava and K. Matou\v{s}. 2014. "Multi-physics Meso-scale Finite Element Simulation of HMX-based Solid Propellant Subjected to Thermal Insults". /March Meeting of the American Physical Society (APS)/, USA.
1. N.A. Khan and Gaurav Srivastava. 2019. "Influence of Openings on the Inelastic Response of Unstiffened Steel Plate Shear Wall Systems". /Structural Engineers World Congress/, Spain.
1. B. Sivakumar, G. Kumar and G. Srivastva. 2023. "Metro egress modeling (fix)". /9th International Congress on Computational Mechanics and Simulations/, Gandhinagar, India.
1. P. R. Prakash and Gaurav Srivastava. 2016. "Numerical modeling of spalling in high strength concrete at high temperature". /Structural Engineering Convention (SEC)/, Chennai, India.
1. S. Shrivastav and Gaurav Srivastava. 2016. "Topology optimization of steel girders subjected to thermal and mechanical loads". /Structural Engineering Convention (SEC)/, Chennai, India.
1. G. Srivastava and S. Wojtkiewicz. 2011. "Efficient Numerical Algorithms for Uncertainty Quantification in Computational Mechanics using {GPUs}". /{SIAM} Conference on Computational Science and Engineering/, Reno, NV, USA.
1. V.K. Singh and G. Srivastva. 2023. "PVME as a sustainable alternative to improve performance of dense mortar at elevated temperature". /International RILEM Conference on Synergising expertise towards sustainability and robustness of cement-based materials and concrete structures (SynerCrete)/, Greece.
1. Gaurav Srivastava and B. Bhatt and P. Kumar and P. Raviprakash. 2014. "Redesigning Police Barricade System for Riots". /International Conference on Design for a Billion/, India.
1. G. Srivastava and S. Wojtkiewicz. 2010. "Use of {GPU} Computing for Uncertainty Quantification in Computational Mechanics". /ASCE Engineering Mechanics Institute Conference, EMI 2010/, Los Angeles, CA, USA.
1. Bathina Siva Kumar and Gaurav Srivastava. 2023. "Numerical investigation on optimum water mist droplet size for pool fire extinguishment". /10th International and 50th National Conference on Fluid Mechanics and Fluid Power (FMFP - 2023)/, India. inreview.
1. D. Yadav and G. Srivastva. 2023. "Multi-physics modeling of the effect of blast load on steel column protected with polyurethane foam". /14th International Symposium on Fire Safety Science (IAFSS)/, Tsukaba, Japan.
1. D. Yadav and G. Srivastva. 2023. "aluminium hollow tube fire (fix)". /9th International Congress on Computational Mechanics and Simulations/, Gandhinagar, India.
1. S. Chandrasekaran and G. Serino and A.K.Jain and S. Miranda and A. Gupta and Gaurav and A. Sharma. 2008. "Influence of Varying Inertia Coefficient and Wave Directionality on {TLP} Geometry". /Eighth {ISOPE} {A}sia/Pacific Offshore Mechanics Symposium ({ISOPE}-{PACOMS}-2008)/, Bangkok, Thailand.
1. Pratyush Dayal and Vaibhav Palkar and Gaurav Srivastava and Olga Kuksenok and Anna C. Balazs. 2015. "Predicting dynamic behaviour of self-oscillating polymer gels using stability analyses". /3rd Soft Matter Young Investigator Meet (SMYIM 2015),/, Pondicherry.
1. S. Chandrasekaran and Gaurav and S. Srivastava. 2008. "Steady and Transient Response of Triangular {TLP}s under Random Wave Load". /Seventh {E}uropean Conference on Structural Dynamics ({EuroDyn} 2008)/, Southampton, U.K..
1. P.R. Prakash and Gaurav Srivastava. 2017. "Efficient three-dimensional nonlinear thermo-mechanical analysis of structures subjected to fire". /Response of Structures under Extreme Loading: Proceedings of {PROTECT}-2017/, China.
1. P.R. Prakash and Gaurav Srivastava. 2015. "Development of a Matrix Method based Framework for the Thermo-mechanical Analysis of {RCC} Frames". /Response of Structures under Extreme Loading: Proceedings of {PROTECT}-2015/, USA, pages: 972-980.
1. Pravinray Gandhi and V. Jagdish and G. Karthidefendedan and A. Chakravarthy and D. Nakrani and C. Ghoroi and G. Srivastava. 2017. "Performance of glass-{ACP} facade system in a full-scale real fire test in a {G}+2 structure". /PROTECT 2017/, .
1. Pravinray Gandhi and V. Jagdish and G. Karthidefendedan and A. Chakravarthy and D. Nakrani and C. Ghoroi and G. Srivastava. 2017. "Performance of glass-ACP facade system in a full-scale real fire test in a {G}+2 structure". /PROTECT 2017/, China, pages: 512--519.
1. A. Bhatt and Gaurav Srivastava. 2016. "Assessment of perturbation and projection-based methods for static reanalysis of linear systems for uncertainty quantification". /EMI 2016/, France.
1. S. Chandrasekaran and Gaurav and A.K.Jain. 2009. "Ringing response of Offshore Compliant Structures". /Proceedings of International Conference on Ocean Engineering ({ICOE} 2009)/, IIT Madras, India, pages: 55--56.
1. S. Chandrasekaran and Gaurav, and S. Srivastava. 2007. "Response Behavior of {TLP}s under Vertical Ground Excitation". /Structural Engineering World Congress/, Bangalore, India.
:end:
